{"data":{"markdownRemark":{"html":"<p>Take a look at this code:</p>\n<pre><code>int main()\n{\n    10 = 1;\n}\n</code></pre>\n<p>Weird, right? We never see someone writing code like this. If we run this code, the get:</p>\n<pre><code>error: lvalue required as left operand of assignment\n10 = 1;\n</code></pre>\n<p>So, we can see that we need lvalue as the left operand, the compiler is telling us <code>10</code> is not an lvalue.</p>\n<h3>So, what is lvalue?</h3>\n<p>lvalue means “locator value.” Overly simply explanation, lvalue is an object that can be the left operand of assignment because initially, lvalues meant objects that can be placed on the left side of an assignment operator.</p>\n<p>Definition:</p>\n<blockquote>\n<p>lvalue is any object that has location in memory of the program.</p>\n</blockquote>\n<p>This explains why we got the previous error, it’s because <code>10</code> doesn’t have a location in memory, it’s not a lvalue.</p>\n<p>Also, that is why the below code works: </p>\n<pre><code>int i;\ni = 10;\n</code></pre>\n<p>Here, <code>i</code> is declared, so it has a location in memory, which means i is a lvalue.</p>\n<h3>lvalue reference</h3>\n<p>This writing will go over two types of references: lvalue reference and rvalue reference. I will talk about rvalue references later in this writing. But now, what is a lvalue reference?</p>\n<blockquote>\n<p>lvalue reference is a reference to a lvalue (existing object that's present in the memory of the program)</p>\n</blockquote>\n<p>lvalue references are created using the <code>&#x26;</code> operator. For example,</p>\n<pre><code>int i = 0;\nint&#x26; ref = i;\n</code></pre>\n<p><code>ref</code> is a lvalue reference to <code>i</code>. That means, any change to <code>i</code> will affect <code>ref</code> and vice versa.</p>\n<p>When creating lvalue references, the assignment operator expects a lvalue on the right side. That's why this code <code>int&#x26; ref = 0;</code> will not compile.</p>\n<p>We get the error:</p>\n<pre><code>error: cannot bind non-const lvalue reference of type 'int&#x26;' to an rvalue of type 'int'\n</code></pre>\n<p>In summary, everything that's defined (have memory address in program memory) is a lvalue. You can assume that everything that has a name is a lvalue.</p>\n<h3>What is rvalue?</h3>\n<p>rvalue is the opposite of lvalue. They are expressions and temporary values that don't have location in the memory.</p>\n<p>If you recall taht everything that's defined and has a name is a lvalue, then anything that doesn't have a name is a rvalue.</p>\n<h3>Conversion between rvalue and lvalue</h3>\n<p>there is an implicit conversion from lvalue to rvalue in function arguments</p>\n<h3>Move constructor</h3>\n<blockquote>\n<p>STILL WRITING</p>\n</blockquote>","frontmatter":{"date":"October 26, 2018","path":"/lvalue-rvalue","title":"lvalues and rvalues in C++"}}},"pageContext":{}}