{"data":{"markdownRemark":{"html":"<p>Two months ago, I tried to run a neural network on my computer. I had the batch size too big and the model wasn’t running. So, I checked the memory consumption and saw that python was taking 30GB in memory. I only have 8GB of RAM on my computer, so I knew something was wrong. Did some research and found about something called <strong>Virtual Memory</strong>. I thought it was interesting, so I decided to write about it.</p>\n<p>Look at this diagram I found from online:</p>\n<p><img src=\"/static/images/memory_layout.png?raw=true\" title=\"Memory Layout\"></p>\n<p>This is a diagram of a program’s memory space. We can see that the memory is <em>continuous</em> from low to high address. We'll get back to this image shortly.</p>\n<p>For the OS, it wants to use memory efficiently. It doesn't want to give a process too much memory, instead giving more memory as a program needs it is much more efficient, in terms of memory management. Then, the memory layout of a program cannot be represented in the physical memory as one whole continuous block of memory (like in the previous image) because that limits the program's memory to a fixed size. Better approach would be to map this continuous block into many fixed size memory blocks (<strong>pages</strong>) that sits somewhere in memory. Shown in the below image:</p>\n<blockquote>\n<p><strong>The purpose of virtual memory is to use memory efficiently and give programs more memory than is physically available.</strong></p>\n</blockquote>\n<p><img src=\"/static/images/virtual_memory_diagram.png?raw=true\" alt=\"Virtual Memory Diagram\" title=\"Virtual Memory Diagram\">\n/static/images/virtual<em>memory</em>diagram.png\nOne interesting thing to note here is the <em>Disk</em>. We can see some memory of this process is from the Disk. This is one of the benefits of virtual memory. <strong>The OS can keep a process running even if there’s no RAM left because it can allocate memory from the Disk</strong>.</p>\n<p>If you remember the story in the beginning of this writing, the reason python had used 30GB of memory was because of the Disk. The OS was keep allocating memory from the Disk. This resulted in more memory for the process, but much slower to fetch and write data to memory.</p>","frontmatter":{"date":"November 05, 2018","path":"/vm","title":"Virtual Memory"}}},"pageContext":{}}