{"data":{"markdownRemark":{"html":"<p>Let’s say you’re writing a function that does something when the user clicks on the mouse. The most obvious and inefficient solution might be to check if the mouse is clicked in some update function that is called every frame. It might look like:</p>\n<pre><code>void Update()\n{\n  if(Input.mousePress() > 0)\n     doSomething();\n}\n</code></pre>\n<p>But, this is very inefficient and it’s a bad code design. Why? Because what if you want other functions in different classes to respond to mouse clicks also. Then, you might have an if statement checking mouse click and calling all those static functions or you might have update functions in each class checking for mouse clicks. Either way, this is an example of bad code.</p>\n<p>We need a better solution. Events are perfect fit for this situation.</p>\n<p>If you’re coding a game, you want to structure your code, in a way that doesn’t make different components depend on each other, events can be very useful in this case. </p>\n<p>In short, <strong>events allow you to get notified on actions and notify other classes on actions.</strong> </p>\n<p>To declare an event, you first need a delegate.</p>\n<blockquote>\n<p>A delegate is an object that stores functions.</p>\n</blockquote>\n<p>This is the syntax for declaring a delegate:\n<code>delegate returnType name([parameters]);</code></p>\n<p>Here's an example of a delegate in C#:</p>\n<pre><code>class MainClass\n{\n  delegate void Del();\n  \n  static void func()\n  {\n    Console.WriteLine(\"Func\");\n  }\n  \n  static void func2()\n  {\n    Console.WriteLine(\"Func2\");\n  }\n\n  public static void Main (string[] args)\n  {\n    Del delInstance = null;\n    delInstance += func;\n    delInstance += func2;\n    delInstance();\n  }\n}\n</code></pre>\n<p>Let's go over this class line by line.\nFirst, we declare a delegate <code>Del</code> with return type <code>void</code> and no parameters. What that means is that all functions <code>Del</code> stores must have a return type of <code>void</code> and no paremeters. We can see that <code>func</code> and <code>func2</code> satisfies these specifications. So, they can be stored in <code>delInstance</code>.</p>\n<p>When we run <code>delInstance()</code>, that calls all the functions stored in <code>delInstance</code>.</p>","frontmatter":{"date":"October 26, 2018","path":"/events-delegates","title":"Using Events and Delegates in Unity"}}},"pageContext":{}}