{"data":{"markdownRemark":{"html":"<p>Let’s say you’re writing a function that does something when the user touches on the screen. The most obvious solution might be to check the touch input in some function that is called every frame. In Unity, it might look like this:</p>\n<pre><code>void Update()\n{\n  if(Input.touchCount > 0)\n     doSomething();\n}\n</code></pre>\n<p>But, this is very inefficient and it’s bad code. Why? Because what if you want other functions in different classes to respond to touch input also. Then, you might need to make this <code>if</code> statement longer or you might have update functions in each classes checking for touch inputs. Either way, this is bad code. </p>\n<p>We need a better solution. Events are perfect for this situation.</p>\n<p>If you’re coding a game, you want to structure your code in a way that doesn’t make different components depend on each other, events can be very useful for that.</p>\n<h3>Definition</h3>\n<p>In short, <strong>events allow you to listen and notify other classes for actions.</strong> </p>\n<p>Events depend on <strong>delegates</strong>, to understand events we first need to know about delegates.</p>\n<blockquote>\n<p><strong>A delegate is an object that stores functions.</strong></p>\n</blockquote>\n<p>This is the syntax for declaring a delegate: </p>\n<pre><code>delegate returnType name([parameters]);\n</code></pre>\n<p>The parameters are optional.</p>\n<p>Here's an example of a delegate in C#:</p>\n<pre><code>class MainClass\n{\n  delegate void Del();\n  \n  static void func()\n  {\n    Console.WriteLine(\"Func\");\n  }\n  \n  static void func2()\n  {\n    Console.WriteLine(\"Func2\");\n  }\n\n  public static void Main(string[] args)\n  {\n    Del delInstance = null;\n    delInstance += func;\n    delInstance += func2;\n    delInstance();\n  }\n}\n</code></pre>\n<p>First, we declare a delegate <code>Del</code> with return type <code>void</code> and no parameters. What that means is that all functions <code>Del</code> stores must have a return type of <code>void</code> and no paremeters. We can see that <code>func</code> and <code>func2</code> satisfies these specifications. So, they can be stored in <code>delInstance</code>.</p>\n<p>When we run <code>delInstance()</code>, that calls all the functions stored in <code>delInstance</code>.</p>\n<blockquote>\n<p>STILL WRITING</p>\n</blockquote>","frontmatter":{"date":"October 26, 2018","path":"/events-delegates","title":"Using Events and Delegates in Unity"}}},"pageContext":{}}